### Чиска данных

In [1]:
# импорт и настройка
# импортирование библиотек
import pandas as pd
import numpy as np
pd.options.display.max_rows = 10

In [3]:
from datetime import datetime

In [4]:
sp500 = pd.read_csv("../../source/sp500_2.csv", 
                    index_col='Symbol',
                    usecols=['Symbol','Sector','Price','BooK Value'])

In [ ]:
# создаем датафрейм с 5 строками и 3 столбцами

In [6]:
df = pd.DataFrame(np.arange(0,15).reshape(5,3),
                  index=['a','b','c','d','e'],
                  columns=['c1','c2','c3'])
df

   c1  c2  c3
a   0   1   2
b   3   4   5
c   6   7   8
d   9  10  11
e  12  13  14

- добавляем несколько столбцов и строк в датафрейм столебц с4 со значением Nan
- строка f со значениями от 15 до 18
- строка g состоящая из значений Nan
- столбец с5 сотоящий из значений Nan
- меняем значения в столбце с4 строки а

In [7]:
df['c4'] = np.nan
df.loc['f'] = np.arange(15,19)
df.loc['g'] = np.nan
df['c5'] = np.nan
df['c4']['a'] = 20
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [5]:
# Поиск 
#  какие элементы имеют значения Nan

In [8]:
df.isnull()

      c1     c2     c3     c4    c5
a  False  False  False  False  True
b  False  False  False   True  True
c  False  False  False   True  True
d  False  False  False   True  True
e  False  False  False   True  True
f  False  False  False  False  True
g   True   True   True   True  True

In [9]:
# какие элементы являются непропущенными значениями? (можем использовать ~df.isnull())

In [10]:
df.notnull()

      c1     c2     c3     c4     c5
a   True   True   True   True  False
b   True   True   True  False  False
c   True   True   True  False  False
d   True   True   True  False  False
e   True   True   True  False  False
f   True   True   True   True  False
g  False  False  False  False  False

In [12]:
# подсчитываем число значений NaN в каждом столбце

In [13]:
df.isnull().sum(axis=0)

c1    1
c2    1
c3    1
c4    5
c5    7
dtype: int64

In [14]:
# вычисляем кол-во значений отличных от NaN по каждолму столбцу(можем использовать len(df)-df.isnull().sum())
df.count(axis=0)

c1    6
c2    6
c3    6
c4    2
c5    0
dtype: int64

In [15]:
len(df)-df.isnull().sum()

c1    6
c2    6
c3    6
c4    2
c5    0
dtype: int64

## Удаление

In [16]:
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [17]:
# отбираем непропущенные значениая в столбце с4
df.c4[df.c4.notnull()]

a    20.0
f    18.0
Name: c4, dtype: float64

In [18]:
# извлекаем в столбце с4 все значения, кроме значений NaN

In [19]:
df.c4.dropna()

a    20.0
f    18.0
Name: c4, dtype: float64

In [20]:
# .dropna() - возвращает копиюс удаленными значениями исходный датафрейм/столбец не изменился

In [21]:
df.c4

a    20.0
b     NaN
c     NaN
d     NaN
e     NaN
f    18.0
g     NaN
Name: c4, dtype: float64

In [22]:
# .dropna() - при применении к датафрейму удаляте целиком строки в которых есть по крайней мере одно значнеие NaN, 
# в нашем случае дудут удалены все строки

In [23]:
df.dropna()

Empty DataFrame
Columns: [c1, c2, c3, c4, c5]
Index: []

In [24]:
# параметр how='all' удаляем лишь те строки, в котрых все значения являются NaN

In [25]:
df.dropna(how='all')

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN

In [26]:
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [27]:
# меняем ось, чтобы удалить столбцы со значениями NaN вместо строк

In [28]:
df.dropna(how='all', axis=1) # удаляем с5

     c1    c2    c3    c4
a   0.0   1.0   2.0  20.0
b   3.0   4.0   5.0   NaN
c   6.0   7.0   8.0   NaN
d   9.0  10.0  11.0   NaN
e  12.0  13.0  14.0   NaN
f  15.0  16.0  17.0  18.0
g   NaN   NaN   NaN   NaN

- созадем копию даатафрейма df
- заменяем две ячейки с пропусками значений 0

In [29]:
df2 = df.copy()
df2.loc['g'].c1 = 0
df2.loc['g'].c3 = 0
df2

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   0.0   NaN   0.0   NaN NaN

In [34]:
# удаляем столбцы в которых есть хотябы одно значнеие NaN
df2.dropna(how='any', axis=1)

     c1    c3
a   0.0   2.0
b   3.0   5.0
c   6.0   8.0
d   9.0  11.0
e  12.0  14.0
f  15.0  17.0
g   0.0   0.0

In [31]:
# удаляем столбцы в которых по меньшей мере 3 значнеия не NaN

In [32]:
df2.dropna(thresh=2, axis=1)

     c1    c2    c3    c4
a   0.0   1.0   2.0  20.0
b   3.0   4.0   5.0   NaN
c   6.0   7.0   8.0   NaN
d   9.0  10.0  11.0   NaN
e  12.0  13.0  14.0   NaN
f  15.0  16.0  17.0  18.0
g   0.0   NaN   0.0   NaN

 ### Заполнение

In [35]:
# константой

In [36]:
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [37]:
# возвращаем новый датафрейм, в котром значения NaN заполнены констатой = 0

In [38]:
filled = df.fillna(0)
filled

     c1    c2    c3    c4   c5
a   0.0   1.0   2.0  20.0  0.0
b   3.0   4.0   5.0   0.0  0.0
c   6.0   7.0   8.0   0.0  0.0
d   9.0  10.0  11.0   0.0  0.0
e  12.0  13.0  14.0   0.0  0.0
f  15.0  16.0  17.0  18.0  0.0
g   0.0   0.0   0.0   0.0  0.0

In [39]:
# значение NaN не учитывается при вычислении средних значнений

In [40]:
df.mean()

c1     7.5
c2     8.5
c3     9.5
c4    19.0
c5     NaN
dtype: float64

In [41]:
# после заполнения значений NaN на 0 получаем другие среднии значнеия

In [42]:
filled.mean()

c1    6.428571
c2    7.285714
c3    8.142857
c4    5.428571
c5    0.000000
dtype: float64

### прямое и обратное

In [43]:
# заполнеине в прямом прядке

In [44]:
df.c4

a    20.0
b     NaN
c     NaN
d     NaN
e     NaN
f    18.0
g     NaN
Name: c4, dtype: float64

In [45]:
df.c4.fillna(method='ffill')

a    20.0
b    20.0
c    20.0
d    20.0
e    20.0
f    18.0
g    18.0
Name: c4, dtype: float64

In [46]:
# обрантое заполнение

In [47]:
df.c4.fillna(method='bfill')

a    20.0
b    18.0
c    18.0
d    18.0
e    18.0
f    18.0
g     NaN
Name: c4, dtype: float64

In [48]:
# c помощью индексов
# новая серия для примеров

In [49]:
fill_values = pd.Series([100,101,102], index=['a','e','g'])
fill_values

a    100
e    101
g    102
dtype: int64

In [50]:
# пример заполнения
df.c4

a    20.0
b     NaN
c     NaN
d     NaN
e     NaN
f    18.0
g     NaN
Name: c4, dtype: float64

In [51]:
df.c4.fillna(fill_values)

a     20.0
b      NaN
c      NaN
d      NaN
e    101.0
f     18.0
g    102.0
Name: c4, dtype: float64

In [52]:
# Заполняем значениея NaN в каждом столбце средним значением этого столбца

In [53]:
df.mean()

c1     7.5
c2     8.5
c3     9.5
c4    19.0
c5     NaN
dtype: float64

In [54]:
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [56]:
df.fillna(df.mean())

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0  19.0 NaN
c   6.0   7.0   8.0  19.0 NaN
d   9.0  10.0  11.0  19.0 NaN
e  12.0  13.0  14.0  19.0 NaN
f  15.0  16.0  17.0  18.0 NaN
g   7.5   8.5   9.5  19.0 NaN

### Интерполяция пропущенных значений

In [57]:
# выполняем линейную интерполяцию (method = 'linear' по умолчанию) значений NaN с 1 по 2

In [58]:
s = pd.Series([1, np.nan, np.nan, np.nan, 2])
s

0    1.0
1    NaN
2    NaN
3    NaN
4    2.0
dtype: float64

In [59]:
s.interpolate()

0    1.00
1    1.25
2    1.50
3    1.75
4    2.00
dtype: float64

In [60]:
# Создаем временной ряд, но при этом значение по одной дате будет пропущено

In [61]:
ts = pd.Series([1, np.nan, 2],
               index =[datetime(2014, 1, 1),
                       datetime(2014, 2, 1),
                       datetime(2014, 4, 1)])
ts

2014-01-01    1.0
2014-02-01    NaN
2014-04-01    2.0
dtype: float64

In [62]:
# линейная интерполяция на основе кол-ва элементов в данной серии

In [63]:
ts.interpolate()

2014-01-01    1.0
2014-02-01    1.5
2014-04-01    2.0
dtype: float64

In [64]:
# этот код учитывает тот факт, что у нас отсутвует запись для 2014-03-01

In [65]:
ts.interpolate(method='time')

2014-01-01    1.000000
2014-02-01    1.344444
2014-04-01    2.000000
dtype: float64

In [66]:
# создаем объект Series, для демонстарации интерполяции, основанной на индексных метках

In [68]:
s = pd.Series([0, np.nan, 100], index=[0, 2, 10])
s

0       0.0
2       NaN
10    100.0
dtype: float64

In [69]:
# выполняем линейную интерполяцию

In [70]:
s.interpolate()

0       0.0
2      50.0
10    100.0
dtype: float64

In [71]:
# выполняем интерполяцию на основе значений индекса

In [72]:
s.interpolate(method='index')

0       0.0
2      20.0
10    100.0
dtype: float64

### Повторяющиеся значения

In [73]:
# создаем датафрейм с дублирущимеся строками

In [75]:
data = pd.DataFrame({'a':['x']*3 + ['y']*4,
                     'b':[1,1,2,3,3,4,4,]})
data

   a  b
0  x  1
1  x  1
2  x  2
3  y  3
4  y  3
5  y  4
6  y  4

In [76]:
# определение дублирующихся строк (по оставляется 1ое значение)

In [77]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [78]:
# удаляем дублирующие строки, каждый раз оставляя последнее из дублирующих значений

In [79]:
data.drop_duplicates(keep='last')

   a  b
1  x  1
2  x  2
4  y  3
6  y  4

In [80]:
data

   a  b
0  x  1
1  x  1
2  x  2
3  y  3
4  y  3
5  y  4
6  y  4

In [81]:
# добавляем столбец

In [82]:
data['c'] = range(7)
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [83]:
# если указать, что необходимо удаление дублирующихся строк с учетом значений в столбцах а и б, то результат

In [84]:
data.drop_duplicates(['a','b'])

   a  b  c
0  x  1  0
2  x  2  2
3  y  3  3
5  y  4  5

### Замена значений

In [85]:
# метод map()
# создаем два объекта Series

In [86]:
x = pd.Series({'one':1, 'two':2, 'tree':3})
y = pd.Series({1:'a', 2:'b', 3:'c'})

In [87]:
x

one     1
two     2
tree    3
dtype: int64

In [88]:
y

1    a
2    b
3    c
dtype: object

In [89]:
# сопоставляем значения серии х со значениями серии у

In [90]:
x.map(y)

one     a
two     b
tree    c
dtype: object

In [104]:
# если между значениемя серии у и индексной меткой серии х не будет найдено соответствие, то будет выдано значнение NaN

In [105]:
x = pd.Series({'one':1, 'two':2, 'tree':3})
y = pd.Series({1:'a', 2:'b'})

In [106]:
x.map(y)

one       a
two       b
tree    NaN
dtype: object

In [91]:
# метод replace()

In [92]:
s = pd.Series([0., 1., 2., 3., 2., 4.])
s

0    0.0
1    1.0
2    2.0
3    3.0
4    2.0
5    4.0
dtype: float64

In [93]:
# замена 2 на 5

In [94]:
s.replace(2,5)

0    0.0
1    1.0
2    5.0
3    3.0
4    5.0
5    4.0
dtype: float64

In [95]:
# замена всех элементво новыми значениями

In [96]:
s.replace([0,1,2,3,4],[4,3,2,1,0])

0    4.0
1    3.0
2    2.0
3    1.0
4    2.0
5    0.0
dtype: float64

In [97]:
s

0    0.0
1    1.0
2    2.0
3    3.0
4    2.0
5    4.0
dtype: float64

In [98]:
# замена элементов с использованием аргументов словаря

In [99]:
s.replace({0: 10, 2: 100})

0     10.0
1      1.0
2    100.0
3      3.0
4    100.0
5      4.0
dtype: float64

In [100]:
# Создаем датафрейм

In [101]:
df= pd.DataFrame({'a': [0,1,2,3,4], 'b': [5,6,7,8,9]})
df

   a  b
0  0  5
1  1  6
2  2  7
3  3  8
4  4  9

In [102]:
# создаем разные заменяемы значения для каждого столбца

In [103]:
df.replace({'a':1, 'b':8}, {'a':777, 'b':888})

     a    b
0    0    5
1  777    6
2    2    7
3    3  888
4    4    9

### Применение функций

In [107]:
# применение функции к строкам/столбцам
# применение функции к каждому элементу объекта Series

In [108]:
s = pd.Series(np.arange(0,5))
s

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [ ]:
# apply применят функцию к каждму элементу Series

In [109]:
s.apply(lambda v:v*3)

0     0
1     3
2     6
3     9
4    12
dtype: int64

In [ ]:
# apply применят (по умолчанию) функцию к каждму столбцу DataFrame
# метод перебирает все столбцы и передает apply каждый столбец в виде объекта Series
# на выходе получем Series где индексы - имена столбцов

In [111]:
df = pd.DataFrame(np.arange(12).reshape(4,3),
                  columns=['a', 'b', 'c'])
df

   a   b   c
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [112]:
# вычисляем сумму элементов в каждом столбце

In [113]:
df.apply(lambda col:col.sum())

a    18
b    22
c    26
dtype: int64

In [114]:
# вычисляем сумму элементов в каждой строке

In [116]:
df.apply(lambda row:row.sum(), axis=1)

0     3
1    12
2    21
3    30
dtype: int64

In [117]:
# создаем столбец 'interim' путем умножения столбцов a, b

In [118]:
df

   a   b   c
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [120]:
# добавление результатов в качестве столбца в датафрейм
df['interim'] = df.apply(lambda r: r.a * r.b, axis=1)
df

   a   b   c  interim
0  0   1   2        0
1  3   4   5       12
2  6   7   8       42
3  9  10  11       90

In [121]:
# создаем столбец 'result' путем сложения столбцов interim, с

In [123]:
df['result'] = df.apply(lambda r: r.interim + r.c, axis=1)
df

   a   b   c  interim  result
0  0   1   2        0       2
1  3   4   5       12      17
2  6   7   8       42      50
3  9  10  11       90     101

In [124]:
# применение функции к значениям 
# applymap() для всех значений датафрейма, чтобы изменить формат всех элементов объекта DataFrame

In [125]:
df

   a   b   c  interim  result
0  0   1   2        0       2
1  3   4   5       12      17
2  6   7   8       42      50
3  9  10  11       90     101

In [126]:
df.applymap(lambda x: np.exp(x)/10)

            a            b            c       interim        result
0    0.100000     0.271828     0.738906  1.000000e-01  7.389056e-01
1    2.008554     5.459815    14.841316  1.627548e+04  2.415495e+06
2   40.342879   109.663316   298.095799  1.739275e+17  5.184706e+20
3  810.308393  2202.646579  5987.414172  1.220403e+38  7.307060e+42